In [1]:
#Q1

In [39]:
import pandas as pd
import datetime as dt

In [4]:
pd.DataFrame([1,2,3]) # convert list into DataFrame object

   0
0  1
1  2
2  3

In [7]:
pd.Series([1,2,3]) # converts list into series object

0    1
1    2
2    3
dtype: int64

In [12]:
l1=pd.DataFrame([1,2])
l2=pd.DataFrame([3,4])

pd.concat([l1,l2]) # concat two dataframes

   0
0  1
1  2
0  3
1  4

In [18]:
data=pd.read_csv('services.csv') # used to read csv data

In [20]:
pd.unique(data.id) # gives unique value

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23])

In [21]:
#Q2

In [22]:
def print_index(df):
    new_index=pd.Series(range(1,len(df)*2+1,2))
    
    df.set_index(new_index,inplace=True)
    
    return df

In [23]:
df = pd.DataFrame({'A': [10, 20, 30, 40],
                   'B': [50, 60, 70, 80],
                   'C': [90, 100, 110, 120]})

In [25]:
print_index(df)

    A   B    C
1  10  50   90
3  20  60  100
5  30  70  110
7  40  80  120

In [26]:
#Q3

In [27]:
df = pd.DataFrame({'A': [10, 20, 30, 40],
                   'values': [50, 60, 70, 80]
                   })

In [28]:
df

    A  values
0  10      50
1  20      60
2  30      70
3  40      80

In [35]:
 sum_t=0
for i in df['values'][0:3]:
    sum_t=i+sum_t
print(sum_t)

180

In [36]:
#Q4

In [38]:
df = pd.DataFrame({'A': [10, 20, 30, 40],
                   'Text': ['mohak', 'khandelwal', 'Test','Score']
                   })

In [41]:
df

    A        Text  word_count
0  10       mohak           4
1  20  khandelwal           4
2  30        Test           4
3  40       Score           4

In [43]:
df['word_count']=df['Text'].apply(lambda x:len(x))

In [44]:
df

    A        Text  word_count
0  10       mohak           5
1  20  khandelwal          10
2  30        Test           4
3  40       Score           5

In [45]:
#Q5

In [46]:
df.shape

(4, 3)

In [47]:
df.size

12

In [48]:
#Q6

pd.read_excel

In [49]:
#Q7

In [50]:
df = pd.DataFrame({'A': [10, 20, 30, 40],
                   'values': ['mk@gmail.com', 'pk@gmail.com', 'ck@gmail.com', 'dk@gmail.com']
                   })

In [51]:
df

    A        values
0  10  mk@gmail.com
1  20  pk@gmail.com
2  30  ck@gmail.com
3  40  dk@gmail.com

In [54]:
df['Username']=df['values'].apply(lambda x:x.split('@')[0])

In [55]:
df

    A        values Username
0  10  mk@gmail.com       mk
1  20  pk@gmail.com       pk
2  30  ck@gmail.com       ck
3  40  dk@gmail.com       dk

In [56]:
#Q8

In [57]:
df = pd.DataFrame({'A': [3,8,6,2,9],
                   'B': [5,2,9,3,1],
                   'C': [1,7,4,5,2]})

In [58]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [59]:
#Q9

In [60]:
df = pd.DataFrame({'A': [10, 20, 30, 40],
                   'values': [50, 60, 70, 80]
                   })

In [63]:
df['values'].mean()

65.0

In [65]:
df['values'].median()

65.0

In [66]:
df['values'].std()

12.909944487358056

In [68]:
#Q10

In [78]:
def moving_avg(df,sales_col_name,date_col,new_col_name,window_size=7):
    df.sort_values(date_col,inplace=True)
    
    df[new_col_name]=df[sales_col_name].rolling(window=window_size,min_periods=1).mean()
    
    return df

In [79]:
df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90],
                   'Date': pd.date_range(start='2023-01-01', periods=9)})

In [80]:
df

   Sales       Date
0     10 2023-01-01
1     20 2023-01-02
2     30 2023-01-03
3     40 2023-01-04
4     50 2023-01-05
5     60 2023-01-06
6     70 2023-01-07
7     80 2023-01-08
8     90 2023-01-09

In [82]:
moving_avg(df,'Sales','Date','Moving_avg',window_size=7)

   Sales       Date  MOving_avg  Moving_avg
0     10 2023-01-01        10.0        10.0
1     20 2023-01-02        15.0        15.0
2     30 2023-01-03        20.0        20.0
3     40 2023-01-04        25.0        25.0
4     50 2023-01-05        30.0        30.0
5     60 2023-01-06        35.0        35.0
6     70 2023-01-07        40.0        40.0
7     80 2023-01-08        50.0        50.0
8     90 2023-01-09        60.0        60.0

In [1]:
#Q11

In [51]:
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-02-15']}

In [52]:
date=pd.DataFrame(data)

In [53]:
date['date_new']=pd.to_datetime(date['Date'])

In [54]:
date['date_new'].apply(lambda x:x.strftime('%A'))

0       Sunday
1       Monday
2      Tuesday
3    Wednesday
4     Thursday
5    Wednesday
Name: date_new, dtype: object

In [55]:
#Q12

In [56]:
date

         Date   date_new
0  2023-01-01 2023-01-01
1  2023-01-02 2023-01-02
2  2023-01-03 2023-01-03
3  2023-01-04 2023-01-04
4  2023-01-05 2023-01-05
5  2023-02-15 2023-02-15

In [57]:
date[(date['date_new']>=pd.to_datetime('2023-01-01')) &(date['date_new']<=pd.to_datetime('2023-01-31'))]

         Date   date_new
0  2023-01-01 2023-01-01
1  2023-01-02 2023-01-02
2  2023-01-03 2023-01-03
3  2023-01-04 2023-01-04
4  2023-01-05 2023-01-05

In [58]:
#Q13

In [59]:
import pandas as pd